6 семестр/КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ПродажаБилетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПродажаБилетов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаБроньБилетов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыручкаПоБилетам</xr:Item>
				<xr:Item>InformationRegister.ИсторияСтатусовЗалов</xr:Item>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кинозал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кинозалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБилета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыБилетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСеанса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаБроньБилетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фильм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фильмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБилетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

6 семестр/КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ПродажаБилетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗавершитьСеанс(Команда)
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		ПоказатьОповещениеПользователя("Внимание", , "Сначала запишите документ!");
		Возврат;
	КонецЕсли;
	
	ЗавершитьСеансНаСервере();
	ПоказатьОповещениеПользователя("Успех", , "Киносеанс завершён, документ оплаты создан.");
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСеансНаСервере()
	Объект.ОкончаниеСеанса = ТекущаяДата();
	Объект.Завершен = Истина;
	
	ЗапросЗадачи = Новый Запрос;
	ЗапросЗадачи.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.ТочкаМаршрута = ЗНАЧЕНИЕ(БизнесПроцесс.ОбслуживаниеПосетителя.ТочкаМаршрута.ПросмотрФильма)
		|	И ЗадачаИсполнителя.БизнесПроцесс.Клиент = &Клиент
		|	И ЗадачаИсполнителя.Выполнена = ЛОЖЬ";
	ЗапросЗадачи.УстановитьПараметр("Клиент", Объект.Клиент);
	РезультатЗадачи = ЗапросЗадачи.Выполнить();
	Если Не РезультатЗадачи.Пустой() Тогда
		ВыборкаЗадачи = РезультатЗадачи.Выбрать();
		Пока ВыборкаЗадачи.Следующий() Цикл
			ЗадачаОбъект = ВыборкаЗадачи.Ссылка.ПолучитьОбъект();
			ЗадачаОбъект.ВыполнитьЗадачу();
		КонецЦикла;
	КонецЕсли;
	
	ДокОплата = Документы.Оплата.СоздатьДокумент();
	ДокОплата.Дата = ТекущаяДата();
	ДокОплата.Клиент = Объект.Клиент;
	ДокОплата.Сумма = Объект.Сумма;
	ДокОплата.Записать(РежимЗаписиДокумента.Проведение);
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииЗаказВБар(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщить("Сначала запишите документ!");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.ЗаказВБар.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры
